espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_ldma.h
/**************************************************************************//**
 * @file
 * @brief EFR32FG25 LDMA register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2022 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32FG25_LDMA_H
#define EFR32FG25_LDMA_H
#define LDMA_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32FG25_LDMA LDMA
 * @{
 * @brief EFR32FG25 LDMA Register Declaration.
 *****************************************************************************/

/** LDMA CH Register Group Declaration. */
typedef struct {
  __IOM uint32_t CFG;                                /**< Configuration                                      */
  __IOM uint32_t LOOP;                               /**< Loop Counter                                       */
  __IOM uint32_t CTRL;                               /**< Control                                            */
  __IOM uint32_t SRC;                                /**< Source Address                                     */
  __IOM uint32_t DST;                                /**< Destination Address                                */
  __IOM uint32_t LINK;                               /**< Link Address                                       */
  __IOM uint32_t XCTRL;                              /**< Extended Control                                   */
  uint32_t       RESERVED0[1U];                      /**< Reserved for future use                            */
  __IOM uint32_t ILSRC;                              /**< Interleaving Source Address                        */
  uint32_t       RESERVED1[3U];                      /**< Reserved for future use                            */
} LDMA_CH_TypeDef;

/** LDMA Register Declaration. */
typedef struct {
  __IM uint32_t   IPVERSION;                    /**< IP version                                         */
  __IOM uint32_t  EN;                           /**< Module enable disable Register                     */
  __IOM uint32_t  SWRST;                        /**< Software Reset Register                            */
  __IOM uint32_t  CTRL;                         /**< Control Register                                   */
  __IM uint32_t   STATUS;                       /**< Status Register                                    */
  __IOM uint32_t  SYNCSWSET;                    /**< Sync Trig Sw Set Register                          */
  __IOM uint32_t  SYNCSWCLR;                    /**< Sync Trig Sw Clear register                        */
  __IOM uint32_t  SYNCHWEN;                     /**< Sync HW trigger enable register                    */
  __IOM uint32_t  SYNCHWSEL;                    /**< Sync HW trigger selection register                 */
  __IM uint32_t   SYNCSTATUS;                   /**< Sync Trigger Status Register                       */
  __IOM uint32_t  CHEN;                         /**< Channel Enable Register                            */
  __IOM uint32_t  CHDIS;                        /**< Channel Disable Register                           */
  __IM uint32_t   CHSTATUS;                     /**< Channel Status Register                            */
  __IM uint32_t   CHBUSY;                       /**< Channel Busy Register                              */
  __IOM uint32_t  CHDONE;                       /**< Channel Linking Done Register                      */
  __IOM uint32_t  DBGHALT;                      /**< Channel Debug Halt Register                        */
  __IOM uint32_t  SWREQ;                        /**< Channel Software Transfer Request                  */
  __IOM uint32_t  REQDIS;                       /**< Channel Request Disable Register                   */
  __IM uint32_t   REQPEND;                      /**< Channel Requests Pending Register                  */
  __IOM uint32_t  LINKLOAD;                     /**< Channel Link Load Register                         */
  __IOM uint32_t  REQCLEAR;                     /**< Channel Request Clear Register                     */
  __IOM uint32_t  IF;                           /**< Interrupt Flag Register                            */
  __IOM uint32_t  IEN;                          /**< Done Interrupt Enable Register                     */
  uint32_t        RESERVED0[1U];                /**< Reserved for future use                            */
  LDMA_CH_TypeDef CH[16U];                      /**< DMA Channel Registers                              */
  uint32_t        RESERVED1[808U];              /**< Reserved for future use                            */
  __IM uint32_t   IPVERSION_SET;                /**< IP version                                         */
  __IOM uint32_t  EN_SET;                       /**< Module enable disable Register                     */
  __IOM uint32_t  SWRST_SET;                    /**< Software Reset Register                            */
  __IOM uint32_t  CTRL_SET;                     /**< Control Register                                   */
  __IM uint32_t   STATUS_SET;                   /**< Status Register                                    */
  __IOM uint32_t  SYNCSWSET_SET;                /**< Sync Trig Sw Set Register                          */
  __IOM uint32_t  SYNCSWCLR_SET;                /**< Sync Trig Sw Clear register                        */
  __IOM uint32_t  SYNCHWEN_SET;                 /**< Sync HW trigger enable register                    */
  __IOM uint32_t  SYNCHWSEL_SET;                /**< Sync HW trigger selection register                 */
  __IM uint32_t   SYNCSTATUS_SET;               /**< Sync Trigger Status Register                       */
  __IOM uint32_t  CHEN_SET;                     /**< Channel Enable Register                            */
  __IOM uint32_t  CHDIS_SET;                    /**< Channel Disable Register                           */
  __IM uint32_t   CHSTATUS_SET;                 /**< Channel Status Register                            */
  __IM uint32_t   CHBUSY_SET;                   /**< Channel Busy Register                              */
  __IOM uint32_t  CHDONE_SET;                   /**< Channel Linking Done Register                      */
  __IOM uint32_t  DBGHALT_SET;                  /**< Channel Debug Halt Register                        */
  __IOM uint32_t  SWREQ_SET;                    /**< Channel Software Transfer Request                  */
  __IOM uint32_t  REQDIS_SET;                   /**< Channel Request Disable Register                   */
  __IM uint32_t   REQPEND_SET;                  /**< Channel Requests Pending Register                  */
  __IOM uint32_t  LINKLOAD_SET;                 /**< Channel Link Load Register                         */
  __IOM uint32_t  REQCLEAR_SET;                 /**< Channel Request Clear Register                     */
  __IOM uint32_t  IF_SET;                       /**< Interrupt Flag Register                            */
  __IOM uint32_t  IEN_SET;                      /**< Done Interrupt Enable Register                     */
  uint32_t        RESERVED2[1U];                /**< Reserved for future use                            */
  LDMA_CH_TypeDef CH_SET[16U];                  /**< DMA Channel Registers                              */
  uint32_t        RESERVED3[808U];              /**< Reserved for future use                            */
  __IM uint32_t   IPVERSION_CLR;                /**< IP version                                         */
  __IOM uint32_t  EN_CLR;                       /**< Module enable disable Register                     */
  __IOM uint32_t  SWRST_CLR;                    /**< Software Reset Register                            */
  __IOM uint32_t  CTRL_CLR;                     /**< Control Register                                   */
  __IM uint32_t   STATUS_CLR;                   /**< Status Register                                    */
  __IOM uint32_t  SYNCSWSET_CLR;                /**< Sync Trig Sw Set Register                          */
  __IOM uint32_t  SYNCSWCLR_CLR;                /**< Sync Trig Sw Clear register                        */
  __IOM uint32_t  SYNCHWEN_CLR;                 /**< Sync HW trigger enable register                    */
  __IOM uint32_t  SYNCHWSEL_CLR;                /**< Sync HW trigger selection register                 */
  __IM uint32_t   SYNCSTATUS_CLR;               /**< Sync Trigger Status Register                       */
  __IOM uint32_t  CHEN_CLR;                     /**< Channel Enable Register                            */
  __IOM uint32_t  CHDIS_CLR;                    /**< Channel Disable Register                           */
  __IM uint32_t   CHSTATUS_CLR;                 /**< Channel Status Register                            */
  __IM uint32_t   CHBUSY_CLR;                   /**< Channel Busy Register                              */
  __IOM uint32_t  CHDONE_CLR;                   /**< Channel Linking Done Register                      */
  __IOM uint32_t  DBGHALT_CLR;                  /**< Channel Debug Halt Register                        */
  __IOM uint32_t  SWREQ_CLR;                    /**< Channel Software Transfer Request                  */
  __IOM uint32_t  REQDIS_CLR;                   /**< Channel Request Disable Register                   */
  __IM uint32_t   REQPEND_CLR;                  /**< Channel Requests Pending Register                  */
  __IOM uint32_t  LINKLOAD_CLR;                 /**< Channel Link Load Register                         */
  __IOM uint32_t  REQCLEAR_CLR;                 /**< Channel Request Clear Register                     */
  __IOM uint32_t  IF_CLR;                       /**< Interrupt Flag Register                            */
  __IOM uint32_t  IEN_CLR;                      /**< Done Interrupt Enable Register                     */
  uint32_t        RESERVED4[1U];                /**< Reserved for future use                            */
  LDMA_CH_TypeDef CH_CLR[16U];                  /**< DMA Channel Registers                              */
  uint32_t        RESERVED5[808U];              /**< Reserved for future use                            */
  __IM uint32_t   IPVERSION_TGL;                /**< IP version                                         */
  __IOM uint32_t  EN_TGL;                       /**< Module enable disable Register                     */
  __IOM uint32_t  SWRST_TGL;                    /**< Software Reset Register                            */
  __IOM uint32_t  CTRL_TGL;                     /**< Control Register                                   */
  __IM uint32_t   STATUS_TGL;                   /**< Status Register                                    */
  __IOM uint32_t  SYNCSWSET_TGL;                /**< Sync Trig Sw Set Register                          */
  __IOM uint32_t  SYNCSWCLR_TGL;                /**< Sync Trig Sw Clear register                        */
  __IOM uint32_t  SYNCHWEN_TGL;                 /**< Sync HW trigger enable register                    */
  __IOM uint32_t  SYNCHWSEL_TGL;                /**< Sync HW trigger selection register                 */
  __IM uint32_t   SYNCSTATUS_TGL;               /**< Sync Trigger Status Register                       */
  __IOM uint32_t  CHEN_TGL;                     /**< Channel Enable Register                            */
  __IOM uint32_t  CHDIS_TGL;                    /**< Channel Disable Register                           */
  __IM uint32_t   CHSTATUS_TGL;                 /**< Channel Status Register                            */
  __IM uint32_t   CHBUSY_TGL;                   /**< Channel Busy Register                              */
  __IOM uint32_t  CHDONE_TGL;                   /**< Channel Linking Done Register                      */
  __IOM uint32_t  DBGHALT_TGL;                  /**< Channel Debug Halt Register                        */
  __IOM uint32_t  SWREQ_TGL;                    /**< Channel Software Transfer Request                  */
  __IOM uint32_t  REQDIS_TGL;                   /**< Channel Request Disable Register                   */
  __IM uint32_t   REQPEND_TGL;                  /**< Channel Requests Pending Register                  */
  __IOM uint32_t  LINKLOAD_TGL;                 /**< Channel Link Load Register                         */
  __IOM uint32_t  REQCLEAR_TGL;                 /**< Channel Request Clear Register                     */
  __IOM uint32_t  IF_TGL;                       /**< Interrupt Flag Register                            */
  __IOM uint32_t  IEN_TGL;                      /**< Done Interrupt Enable Register                     */
  uint32_t        RESERVED6[1U];                /**< Reserved for future use                            */
  LDMA_CH_TypeDef CH_TGL[16U];                  /**< DMA Channel Registers                              */
} LDMA_TypeDef;
/** @} End of group EFR32FG25_LDMA */

/**************************************************************************//**
 * @addtogroup EFR32FG25_LDMA
 * @{
 * @defgroup EFR32FG25_LDMA_BitFields LDMA Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for LDMA IPVERSION */
#define _LDMA_IPVERSION_RESETVALUE              0x00000001UL                             /**< Default value for LDMA_IPVERSION            */
#define _LDMA_IPVERSION_MASK                    0xFFFFFFFFUL                             /**< Mask for LDMA_IPVERSION                     */
#define _LDMA_IPVERSION_IPVERSION_SHIFT         0                                        /**< Shift value for LDMA_IPVERSION              */
#define _LDMA_IPVERSION_IPVERSION_MASK          0xFFFFFFFFUL                             /**< Bit mask for LDMA_IPVERSION                 */
#define _LDMA_IPVERSION_IPVERSION_DEFAULT       0x00000001UL                             /**< Mode DEFAULT for LDMA_IPVERSION             */
#define LDMA_IPVERSION_IPVERSION_DEFAULT        (_LDMA_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for LDMA_IPVERSION     */

/* Bit fields for LDMA EN */
#define _LDMA_EN_RESETVALUE                     0x00000000UL                            /**< Default value for LDMA_EN                   */
#define _LDMA_EN_MASK                           0x00000003UL                            /**< Mask for LDMA_EN                            */
#define LDMA_EN_EN                              (0x1UL << 0)                            /**< Module Enable                               */
#define _LDMA_EN_EN_SHIFT                       0                                       /**< Shift value for LDMA_EN                     */
#define _LDMA_EN_EN_MASK                        0x1UL                                   /**< Bit mask for LDMA_EN                        */
#define _LDMA_EN_EN_DEFAULT                     0x00000000UL                            /**< Mode DEFAULT for LDMA_EN                    */
#define LDMA_EN_EN_DEFAULT                      (_LDMA_EN_EN_DEFAULT << 0)              /**< Shifted mode DEFAULT for LDMA_EN            */
#define LDMA_EN_DISABLING                       (0x1UL << 1)                            /**< Disablement busy status                     */
#define _LDMA_EN_DISABLING_SHIFT                1                                       /**< Shift value for LDMA_DISABLING              */
#define _LDMA_EN_DISABLING_MASK                 0x2UL                                   /**< Bit mask for LDMA_DISABLING                 */
#define _LDMA_EN_DISABLING_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for LDMA_EN                    */
#define LDMA_EN_DISABLING_DEFAULT               (_LDMA_EN_DISABLING_DEFAULT << 1)       /**< Shifted mode DEFAULT for LDMA_EN            */

/* Bit fields for LDMA SWRST */
#define _LDMA_SWRST_RESETVALUE                  0x00000000UL                            /**< Default value for LDMA_SWRST                */
#define _LDMA_SWRST_MASK                        0x00000003UL                            /**< Mask for LDMA_SWRST                         */
#define LDMA_SWRST_SWRST                        (0x1UL << 0)                            /**< Software Reset Command                      */
#define _LDMA_SWRST_SWRST_SHIFT                 0                                       /**< Shift value for LDMA_SWRST                  */
#define _LDMA_SWRST_SWRST_MASK                  0x1UL                                   /**< Bit mask for LDMA_SWRST                     */
#define _LDMA_SWRST_SWRST_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for LDMA_SWRST                 */
#define LDMA_SWRST_SWRST_DEFAULT                (_LDMA_SWRST_SWRST_DEFAULT << 0)        /**< Shifted mode DEFAULT for LDMA_SWRST         */
#define LDMA_SWRST_RESETTING                    (0x1UL << 1)                            /**< Software Reset Busy Status                  */
#define _LDMA_SWRST_RESETTING_SHIFT             1                                       /**< Shift value for LDMA_RESETTING              */
#define _LDMA_SWRST_RESETTING_MASK              0x2UL                                   /**< Bit mask for LDMA_RESETTING                 */
#define _LDMA_SWRST_RESETTING_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for LDMA_SWRST                 */
#define LDMA_SWRST_RESETTING_DEFAULT            (_LDMA_SWRST_RESETTING_DEFAULT << 1)    /**< Shifted mode DEFAULT for LDMA_SWRST         */

/* Bit fields for LDMA CTRL */
#define _LDMA_CTRL_RESETVALUE                   0x1E000000UL                            /**< Default value for LDMA_CTRL                 */
#define _LDMA_CTRL_MASK                         0x3F000000UL                            /**< Mask for LDMA_CTRL                          */
#define _LDMA_CTRL_NUMFIXED_SHIFT               24                                      /**< Shift value for LDMA_NUMFIXED               */
#define _LDMA_CTRL_NUMFIXED_MASK                0x3F000000UL                            /**< Bit mask for LDMA_NUMFIXED                  */
#define _LDMA_CTRL_NUMFIXED_DEFAULT             0x0000001EUL                            /**< Mode DEFAULT for LDMA_CTRL                  */
#define LDMA_CTRL_NUMFIXED_DEFAULT              (_LDMA_CTRL_NUMFIXED_DEFAULT << 24)     /**< Shifted mode DEFAULT for LDMA_CTRL          */

