espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_ldma.h
/* Bit fields for LDMA CHDONE */
#define _LDMA_CHDONE_RESETVALUE                 0x00000000UL                            /**< Default value for LDMA_CHDONE               */
#define _LDMA_CHDONE_MASK                       0x0000FFFFUL                            /**< Mask for LDMA_CHDONE                        */
#define LDMA_CHDONE_CHDONE0                     (0x1UL << 0)                            /**< Channel Linking Done Status flag            */
#define _LDMA_CHDONE_CHDONE0_SHIFT              0                                       /**< Shift value for LDMA_CHDONE0                */
#define _LDMA_CHDONE_CHDONE0_MASK               0x1UL                                   /**< Bit mask for LDMA_CHDONE0                   */
#define _LDMA_CHDONE_CHDONE0_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for LDMA_CHDONE                */
#define LDMA_CHDONE_CHDONE0_DEFAULT             (_LDMA_CHDONE_CHDONE0_DEFAULT << 0)     /**< Shifted mode DEFAULT for LDMA_CHDONE        */
#define LDMA_CHDONE_CHDONE1                     (0x1UL << 1)                            /**< Channel Linking Done Status flag            */
#define _LDMA_CHDONE_CHDONE1_SHIFT              1                                       /**< Shift value for LDMA_CHDONE1                */
#define _LDMA_CHDONE_CHDONE1_MASK               0x2UL                                   /**< Bit mask for LDMA_CHDONE1                   */
#define _LDMA_CHDONE_CHDONE1_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for LDMA_CHDONE                */
#define LDMA_CHDONE_CHDONE1_DEFAULT             (_LDMA_CHDONE_CHDONE1_DEFAULT << 1)     /**< Shifted mode DEFAULT for LDMA_CHDONE        */
#define LDMA_CHDONE_CHDONE2                     (0x1UL << 2)                            /**< Channel Linking Done Status flag            */
#define _LDMA_CHDONE_CHDONE2_SHIFT              2                                       /**< Shift value for LDMA_CHDONE2                */
#define _LDMA_CHDONE_CHDONE2_MASK               0x4UL                                   /**< Bit mask for LDMA_CHDONE2                   */
#define _LDMA_CHDONE_CHDONE2_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for LDMA_CHDONE                */
#define LDMA_CHDONE_CHDONE2_DEFAULT             (_LDMA_CHDONE_CHDONE2_DEFAULT << 2)     /**< Shifted mode DEFAULT for LDMA_CHDONE        */
#define LDMA_CHDONE_CHDONE3                     (0x1UL << 3)                            /**< Channel Linking Done Status flag            */
#define _LDMA_CHDONE_CHDONE3_SHIFT              3                                       /**< Shift value for LDMA_CHDONE3                */
#define _LDMA_CHDONE_CHDONE3_MASK               0x8UL                                   /**< Bit mask for LDMA_CHDONE3                   */
#define _LDMA_CHDONE_CHDONE3_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for LDMA_CHDONE                */
#define LDMA_CHDONE_CHDONE3_DEFAULT             (_LDMA_CHDONE_CHDONE3_DEFAULT << 3)     /**< Shifted mode DEFAULT for LDMA_CHDONE        */
#define LDMA_CHDONE_CHDONE4                     (0x1UL << 4)                            /**< Channel Linking Done Status flag            */
#define _LDMA_CHDONE_CHDONE4_SHIFT              4                                       /**< Shift value for LDMA_CHDONE4                */
#define _LDMA_CHDONE_CHDONE4_MASK               0x10UL                                  /**< Bit mask for LDMA_CHDONE4                   */
#define _LDMA_CHDONE_CHDONE4_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for LDMA_CHDONE                */
#define LDMA_CHDONE_CHDONE4_DEFAULT             (_LDMA_CHDONE_CHDONE4_DEFAULT << 4)     /**< Shifted mode DEFAULT for LDMA_CHDONE        */
#define LDMA_CHDONE_CHDONE5                     (0x1UL << 5)                            /**< Channel Linking Done Status flag            */
#define _LDMA_CHDONE_CHDONE5_SHIFT              5                                       /**< Shift value for LDMA_CHDONE5                */
#define _LDMA_CHDONE_CHDONE5_MASK               0x20UL                                  /**< Bit mask for LDMA_CHDONE5                   */
#define _LDMA_CHDONE_CHDONE5_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for LDMA_CHDONE                */
#define LDMA_CHDONE_CHDONE5_DEFAULT             (_LDMA_CHDONE_CHDONE5_DEFAULT << 5)     /**< Shifted mode DEFAULT for LDMA_CHDONE        */
#define LDMA_CHDONE_CHDONE6                     (0x1UL << 6)                            /**< Channel Linking Done Status flag            */
#define _LDMA_CHDONE_CHDONE6_SHIFT              6                                       /**< Shift value for LDMA_CHDONE6                */
#define _LDMA_CHDONE_CHDONE6_MASK               0x40UL                                  /**< Bit mask for LDMA_CHDONE6                   */
#define _LDMA_CHDONE_CHDONE6_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for LDMA_CHDONE                */
#define LDMA_CHDONE_CHDONE6_DEFAULT             (_LDMA_CHDONE_CHDONE6_DEFAULT << 6)     /**< Shifted mode DEFAULT for LDMA_CHDONE        */
#define LDMA_CHDONE_CHDONE7                     (0x1UL << 7)                            /**< Channel Linking Done Status flag            */
#define _LDMA_CHDONE_CHDONE7_SHIFT              7                                       /**< Shift value for LDMA_CHDONE7                */
#define _LDMA_CHDONE_CHDONE7_MASK               0x80UL                                  /**< Bit mask for LDMA_CHDONE7                   */
#define _LDMA_CHDONE_CHDONE7_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for LDMA_CHDONE                */
#define LDMA_CHDONE_CHDONE7_DEFAULT             (_LDMA_CHDONE_CHDONE7_DEFAULT << 7)     /**< Shifted mode DEFAULT for LDMA_CHDONE        */
#define LDMA_CHDONE_CHDONE8                     (0x1UL << 8)                            /**< Channel Linking Done Status flag            */
#define _LDMA_CHDONE_CHDONE8_SHIFT              8                                       /**< Shift value for LDMA_CHDONE8                */
#define _LDMA_CHDONE_CHDONE8_MASK               0x100UL                                 /**< Bit mask for LDMA_CHDONE8                   */
#define _LDMA_CHDONE_CHDONE8_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for LDMA_CHDONE                */
#define LDMA_CHDONE_CHDONE8_DEFAULT             (_LDMA_CHDONE_CHDONE8_DEFAULT << 8)     /**< Shifted mode DEFAULT for LDMA_CHDONE        */
#define LDMA_CHDONE_CHDONE9                     (0x1UL << 9)                            /**< Channel Linking Done Status flag            */
#define _LDMA_CHDONE_CHDONE9_SHIFT              9                                       /**< Shift value for LDMA_CHDONE9                */
#define _LDMA_CHDONE_CHDONE9_MASK               0x200UL                                 /**< Bit mask for LDMA_CHDONE9                   */
#define _LDMA_CHDONE_CHDONE9_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for LDMA_CHDONE                */
#define LDMA_CHDONE_CHDONE9_DEFAULT             (_LDMA_CHDONE_CHDONE9_DEFAULT << 9)     /**< Shifted mode DEFAULT for LDMA_CHDONE        */
#define LDMA_CHDONE_CHDONE10                    (0x1UL << 10)                           /**< Channel Linking Done Status flag            */
#define _LDMA_CHDONE_CHDONE10_SHIFT             10                                      /**< Shift value for LDMA_CHDONE10               */
#define _LDMA_CHDONE_CHDONE10_MASK              0x400UL                                 /**< Bit mask for LDMA_CHDONE10                  */
#define _LDMA_CHDONE_CHDONE10_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for LDMA_CHDONE                */
#define LDMA_CHDONE_CHDONE10_DEFAULT            (_LDMA_CHDONE_CHDONE10_DEFAULT << 10)   /**< Shifted mode DEFAULT for LDMA_CHDONE        */
#define LDMA_CHDONE_CHDONE11                    (0x1UL << 11)                           /**< Channel Linking Done Status flag            */
#define _LDMA_CHDONE_CHDONE11_SHIFT             11                                      /**< Shift value for LDMA_CHDONE11               */
#define _LDMA_CHDONE_CHDONE11_MASK              0x800UL                                 /**< Bit mask for LDMA_CHDONE11                  */
#define _LDMA_CHDONE_CHDONE11_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for LDMA_CHDONE                */
#define LDMA_CHDONE_CHDONE11_DEFAULT            (_LDMA_CHDONE_CHDONE11_DEFAULT << 11)   /**< Shifted mode DEFAULT for LDMA_CHDONE        */
#define LDMA_CHDONE_CHDONE12                    (0x1UL << 12)                           /**< Channel Linking Done Status flag            */
#define _LDMA_CHDONE_CHDONE12_SHIFT             12                                      /**< Shift value for LDMA_CHDONE12               */
#define _LDMA_CHDONE_CHDONE12_MASK              0x1000UL                                /**< Bit mask for LDMA_CHDONE12                  */
#define _LDMA_CHDONE_CHDONE12_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for LDMA_CHDONE                */
#define LDMA_CHDONE_CHDONE12_DEFAULT            (_LDMA_CHDONE_CHDONE12_DEFAULT << 12)   /**< Shifted mode DEFAULT for LDMA_CHDONE        */
#define LDMA_CHDONE_CHDONE13                    (0x1UL << 13)                           /**< Channel Linking Done Status flag            */
#define _LDMA_CHDONE_CHDONE13_SHIFT             13                                      /**< Shift value for LDMA_CHDONE13               */
#define _LDMA_CHDONE_CHDONE13_MASK              0x2000UL                                /**< Bit mask for LDMA_CHDONE13                  */
#define _LDMA_CHDONE_CHDONE13_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for LDMA_CHDONE                */
#define LDMA_CHDONE_CHDONE13_DEFAULT            (_LDMA_CHDONE_CHDONE13_DEFAULT << 13)   /**< Shifted mode DEFAULT for LDMA_CHDONE        */
#define LDMA_CHDONE_CHDONE14                    (0x1UL << 14)                           /**< Channel Linking Done Status flag            */
#define _LDMA_CHDONE_CHDONE14_SHIFT             14                                      /**< Shift value for LDMA_CHDONE14               */
#define _LDMA_CHDONE_CHDONE14_MASK              0x4000UL                                /**< Bit mask for LDMA_CHDONE14                  */
#define _LDMA_CHDONE_CHDONE14_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for LDMA_CHDONE                */
#define LDMA_CHDONE_CHDONE14_DEFAULT            (_LDMA_CHDONE_CHDONE14_DEFAULT << 14)   /**< Shifted mode DEFAULT for LDMA_CHDONE        */
#define LDMA_CHDONE_CHDONE15                    (0x1UL << 15)                           /**< Channel Linking Done Status flag            */
#define _LDMA_CHDONE_CHDONE15_SHIFT             15                                      /**< Shift value for LDMA_CHDONE15               */
#define _LDMA_CHDONE_CHDONE15_MASK              0x8000UL                                /**< Bit mask for LDMA_CHDONE15                  */
#define _LDMA_CHDONE_CHDONE15_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for LDMA_CHDONE                */
#define LDMA_CHDONE_CHDONE15_DEFAULT            (_LDMA_CHDONE_CHDONE15_DEFAULT << 15)   /**< Shifted mode DEFAULT for LDMA_CHDONE        */

/* Bit fields for LDMA DBGHALT */
#define _LDMA_DBGHALT_RESETVALUE                0x00000000UL                            /**< Default value for LDMA_DBGHALT              */
#define _LDMA_DBGHALT_MASK                      0x0000FFFFUL                            /**< Mask for LDMA_DBGHALT                       */
#define _LDMA_DBGHALT_DBGHALT_SHIFT             0                                       /**< Shift value for LDMA_DBGHALT                */
#define _LDMA_DBGHALT_DBGHALT_MASK              0xFFFFUL                                /**< Bit mask for LDMA_DBGHALT                   */
#define _LDMA_DBGHALT_DBGHALT_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for LDMA_DBGHALT               */
#define LDMA_DBGHALT_DBGHALT_DEFAULT            (_LDMA_DBGHALT_DBGHALT_DEFAULT << 0)    /**< Shifted mode DEFAULT for LDMA_DBGHALT       */

/* Bit fields for LDMA SWREQ */
#define _LDMA_SWREQ_RESETVALUE                  0x00000000UL                            /**< Default value for LDMA_SWREQ                */
#define _LDMA_SWREQ_MASK                        0x0000FFFFUL                            /**< Mask for LDMA_SWREQ                         */
#define _LDMA_SWREQ_SWREQ_SHIFT                 0                                       /**< Shift value for LDMA_SWREQ                  */
#define _LDMA_SWREQ_SWREQ_MASK                  0xFFFFUL                                /**< Bit mask for LDMA_SWREQ                     */
#define _LDMA_SWREQ_SWREQ_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for LDMA_SWREQ                 */
#define LDMA_SWREQ_SWREQ_DEFAULT                (_LDMA_SWREQ_SWREQ_DEFAULT << 0)        /**< Shifted mode DEFAULT for LDMA_SWREQ         */

