espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_ldma.h
/* Bit fields for LDMA IEN */
#define _LDMA_IEN_RESETVALUE                    0x00000000UL                            /**< Default value for LDMA_IEN                  */
#define _LDMA_IEN_MASK                          0x8000FFFFUL                            /**< Mask for LDMA_IEN                           */
#define LDMA_IEN_DONE0                          (0x1UL << 0)                            /**< Done Interrupt Enable                       */
#define _LDMA_IEN_DONE0_SHIFT                   0                                       /**< Shift value for LDMA_DONE0                  */
#define _LDMA_IEN_DONE0_MASK                    0x1UL                                   /**< Bit mask for LDMA_DONE0                     */
#define _LDMA_IEN_DONE0_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for LDMA_IEN                   */
#define LDMA_IEN_DONE0_DEFAULT                  (_LDMA_IEN_DONE0_DEFAULT << 0)          /**< Shifted mode DEFAULT for LDMA_IEN           */
#define LDMA_IEN_DONE1                          (0x1UL << 1)                            /**< Done Interrupt Enable                       */
#define _LDMA_IEN_DONE1_SHIFT                   1                                       /**< Shift value for LDMA_DONE1                  */
#define _LDMA_IEN_DONE1_MASK                    0x2UL                                   /**< Bit mask for LDMA_DONE1                     */
#define _LDMA_IEN_DONE1_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for LDMA_IEN                   */
#define LDMA_IEN_DONE1_DEFAULT                  (_LDMA_IEN_DONE1_DEFAULT << 1)          /**< Shifted mode DEFAULT for LDMA_IEN           */
#define LDMA_IEN_DONE2                          (0x1UL << 2)                            /**< Done Interrupt Enable                       */
#define _LDMA_IEN_DONE2_SHIFT                   2                                       /**< Shift value for LDMA_DONE2                  */
#define _LDMA_IEN_DONE2_MASK                    0x4UL                                   /**< Bit mask for LDMA_DONE2                     */
#define _LDMA_IEN_DONE2_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for LDMA_IEN                   */
#define LDMA_IEN_DONE2_DEFAULT                  (_LDMA_IEN_DONE2_DEFAULT << 2)          /**< Shifted mode DEFAULT for LDMA_IEN           */
#define LDMA_IEN_DONE3                          (0x1UL << 3)                            /**< Done Interrupt Enable                       */
#define _LDMA_IEN_DONE3_SHIFT                   3                                       /**< Shift value for LDMA_DONE3                  */
#define _LDMA_IEN_DONE3_MASK                    0x8UL                                   /**< Bit mask for LDMA_DONE3                     */
#define _LDMA_IEN_DONE3_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for LDMA_IEN                   */
#define LDMA_IEN_DONE3_DEFAULT                  (_LDMA_IEN_DONE3_DEFAULT << 3)          /**< Shifted mode DEFAULT for LDMA_IEN           */
#define LDMA_IEN_DONE4                          (0x1UL << 4)                            /**< Done Interrupt Enable                       */
#define _LDMA_IEN_DONE4_SHIFT                   4                                       /**< Shift value for LDMA_DONE4                  */
#define _LDMA_IEN_DONE4_MASK                    0x10UL                                  /**< Bit mask for LDMA_DONE4                     */
#define _LDMA_IEN_DONE4_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for LDMA_IEN                   */
#define LDMA_IEN_DONE4_DEFAULT                  (_LDMA_IEN_DONE4_DEFAULT << 4)          /**< Shifted mode DEFAULT for LDMA_IEN           */
#define LDMA_IEN_DONE5                          (0x1UL << 5)                            /**< Done Interrupt Enable                       */
#define _LDMA_IEN_DONE5_SHIFT                   5                                       /**< Shift value for LDMA_DONE5                  */
#define _LDMA_IEN_DONE5_MASK                    0x20UL                                  /**< Bit mask for LDMA_DONE5                     */
#define _LDMA_IEN_DONE5_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for LDMA_IEN                   */
#define LDMA_IEN_DONE5_DEFAULT                  (_LDMA_IEN_DONE5_DEFAULT << 5)          /**< Shifted mode DEFAULT for LDMA_IEN           */
#define LDMA_IEN_DONE6                          (0x1UL << 6)                            /**< Done Interrupt Enable                       */
#define _LDMA_IEN_DONE6_SHIFT                   6                                       /**< Shift value for LDMA_DONE6                  */
#define _LDMA_IEN_DONE6_MASK                    0x40UL                                  /**< Bit mask for LDMA_DONE6                     */
#define _LDMA_IEN_DONE6_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for LDMA_IEN                   */
#define LDMA_IEN_DONE6_DEFAULT                  (_LDMA_IEN_DONE6_DEFAULT << 6)          /**< Shifted mode DEFAULT for LDMA_IEN           */
#define LDMA_IEN_DONE7                          (0x1UL << 7)                            /**< Done Interrupt Enable                       */
#define _LDMA_IEN_DONE7_SHIFT                   7                                       /**< Shift value for LDMA_DONE7                  */
#define _LDMA_IEN_DONE7_MASK                    0x80UL                                  /**< Bit mask for LDMA_DONE7                     */
#define _LDMA_IEN_DONE7_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for LDMA_IEN                   */
#define LDMA_IEN_DONE7_DEFAULT                  (_LDMA_IEN_DONE7_DEFAULT << 7)          /**< Shifted mode DEFAULT for LDMA_IEN           */
#define LDMA_IEN_DONE8                          (0x1UL << 8)                            /**< Done Interrupt Enable                       */
#define _LDMA_IEN_DONE8_SHIFT                   8                                       /**< Shift value for LDMA_DONE8                  */
#define _LDMA_IEN_DONE8_MASK                    0x100UL                                 /**< Bit mask for LDMA_DONE8                     */
#define _LDMA_IEN_DONE8_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for LDMA_IEN                   */
#define LDMA_IEN_DONE8_DEFAULT                  (_LDMA_IEN_DONE8_DEFAULT << 8)          /**< Shifted mode DEFAULT for LDMA_IEN           */
#define LDMA_IEN_DONE9                          (0x1UL << 9)                            /**< Done Interrupt Enable                       */
#define _LDMA_IEN_DONE9_SHIFT                   9                                       /**< Shift value for LDMA_DONE9                  */
#define _LDMA_IEN_DONE9_MASK                    0x200UL                                 /**< Bit mask for LDMA_DONE9                     */
#define _LDMA_IEN_DONE9_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for LDMA_IEN                   */
#define LDMA_IEN_DONE9_DEFAULT                  (_LDMA_IEN_DONE9_DEFAULT << 9)          /**< Shifted mode DEFAULT for LDMA_IEN           */
#define LDMA_IEN_DONE10                         (0x1UL << 10)                           /**< Done Interrupt Enable                       */
#define _LDMA_IEN_DONE10_SHIFT                  10                                      /**< Shift value for LDMA_DONE10                 */
#define _LDMA_IEN_DONE10_MASK                   0x400UL                                 /**< Bit mask for LDMA_DONE10                    */
#define _LDMA_IEN_DONE10_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for LDMA_IEN                   */
#define LDMA_IEN_DONE10_DEFAULT                 (_LDMA_IEN_DONE10_DEFAULT << 10)        /**< Shifted mode DEFAULT for LDMA_IEN           */
#define LDMA_IEN_DONE11                         (0x1UL << 11)                           /**< Done Interrupt Enable                       */
#define _LDMA_IEN_DONE11_SHIFT                  11                                      /**< Shift value for LDMA_DONE11                 */
#define _LDMA_IEN_DONE11_MASK                   0x800UL                                 /**< Bit mask for LDMA_DONE11                    */
#define _LDMA_IEN_DONE11_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for LDMA_IEN                   */
#define LDMA_IEN_DONE11_DEFAULT                 (_LDMA_IEN_DONE11_DEFAULT << 11)        /**< Shifted mode DEFAULT for LDMA_IEN           */
#define LDMA_IEN_DONE12                         (0x1UL << 12)                           /**< Done Interrupt Enable                       */
#define _LDMA_IEN_DONE12_SHIFT                  12                                      /**< Shift value for LDMA_DONE12                 */
#define _LDMA_IEN_DONE12_MASK                   0x1000UL                                /**< Bit mask for LDMA_DONE12                    */
#define _LDMA_IEN_DONE12_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for LDMA_IEN                   */
#define LDMA_IEN_DONE12_DEFAULT                 (_LDMA_IEN_DONE12_DEFAULT << 12)        /**< Shifted mode DEFAULT for LDMA_IEN           */
#define LDMA_IEN_DONE13                         (0x1UL << 13)                           /**< Done Interrupt Enable                       */
#define _LDMA_IEN_DONE13_SHIFT                  13                                      /**< Shift value for LDMA_DONE13                 */
#define _LDMA_IEN_DONE13_MASK                   0x2000UL                                /**< Bit mask for LDMA_DONE13                    */
#define _LDMA_IEN_DONE13_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for LDMA_IEN                   */
#define LDMA_IEN_DONE13_DEFAULT                 (_LDMA_IEN_DONE13_DEFAULT << 13)        /**< Shifted mode DEFAULT for LDMA_IEN           */
#define LDMA_IEN_DONE14                         (0x1UL << 14)                           /**< Done Interrupt Enable                       */
#define _LDMA_IEN_DONE14_SHIFT                  14                                      /**< Shift value for LDMA_DONE14                 */
#define _LDMA_IEN_DONE14_MASK                   0x4000UL                                /**< Bit mask for LDMA_DONE14                    */
#define _LDMA_IEN_DONE14_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for LDMA_IEN                   */
#define LDMA_IEN_DONE14_DEFAULT                 (_LDMA_IEN_DONE14_DEFAULT << 14)        /**< Shifted mode DEFAULT for LDMA_IEN           */
#define LDMA_IEN_DONE15                         (0x1UL << 15)                           /**< Done Interrupt Enable                       */
#define _LDMA_IEN_DONE15_SHIFT                  15                                      /**< Shift value for LDMA_DONE15                 */
#define _LDMA_IEN_DONE15_MASK                   0x8000UL                                /**< Bit mask for LDMA_DONE15                    */
#define _LDMA_IEN_DONE15_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for LDMA_IEN                   */
#define LDMA_IEN_DONE15_DEFAULT                 (_LDMA_IEN_DONE15_DEFAULT << 15)        /**< Shifted mode DEFAULT for LDMA_IEN           */
#define LDMA_IEN_ERROR                          (0x1UL << 31)                           /**< Error Interrupt Enable                      */
#define _LDMA_IEN_ERROR_SHIFT                   31                                      /**< Shift value for LDMA_ERROR                  */
#define _LDMA_IEN_ERROR_MASK                    0x80000000UL                            /**< Bit mask for LDMA_ERROR                     */
#define _LDMA_IEN_ERROR_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for LDMA_IEN                   */
#define LDMA_IEN_ERROR_DEFAULT                  (_LDMA_IEN_ERROR_DEFAULT << 31)         /**< Shifted mode DEFAULT for LDMA_IEN           */

/* Bit fields for LDMA CH_CFG */
#define _LDMA_CH_CFG_RESETVALUE                 0x00000000UL                               /**< Default value for LDMA_CH_CFG               */
#define _LDMA_CH_CFG_MASK                       0x01F30000UL                               /**< Mask for LDMA_CH_CFG                        */
#define _LDMA_CH_CFG_ARBSLOTS_SHIFT             16                                         /**< Shift value for LDMA_ARBSLOTS               */
#define _LDMA_CH_CFG_ARBSLOTS_MASK              0x30000UL                                  /**< Bit mask for LDMA_ARBSLOTS                  */
#define _LDMA_CH_CFG_ARBSLOTS_DEFAULT           0x00000000UL                               /**< Mode DEFAULT for LDMA_CH_CFG                */
#define _LDMA_CH_CFG_ARBSLOTS_ONE               0x00000000UL                               /**< Mode ONE for LDMA_CH_CFG                    */
#define _LDMA_CH_CFG_ARBSLOTS_TWO               0x00000001UL                               /**< Mode TWO for LDMA_CH_CFG                    */
#define _LDMA_CH_CFG_ARBSLOTS_FOUR              0x00000002UL                               /**< Mode FOUR for LDMA_CH_CFG                   */
#define _LDMA_CH_CFG_ARBSLOTS_EIGHT             0x00000003UL                               /**< Mode EIGHT for LDMA_CH_CFG                  */
#define LDMA_CH_CFG_ARBSLOTS_DEFAULT            (_LDMA_CH_CFG_ARBSLOTS_DEFAULT << 16)      /**< Shifted mode DEFAULT for LDMA_CH_CFG        */
#define LDMA_CH_CFG_ARBSLOTS_ONE                (_LDMA_CH_CFG_ARBSLOTS_ONE << 16)          /**< Shifted mode ONE for LDMA_CH_CFG            */
#define LDMA_CH_CFG_ARBSLOTS_TWO                (_LDMA_CH_CFG_ARBSLOTS_TWO << 16)          /**< Shifted mode TWO for LDMA_CH_CFG            */
#define LDMA_CH_CFG_ARBSLOTS_FOUR               (_LDMA_CH_CFG_ARBSLOTS_FOUR << 16)         /**< Shifted mode FOUR for LDMA_CH_CFG           */
#define LDMA_CH_CFG_ARBSLOTS_EIGHT              (_LDMA_CH_CFG_ARBSLOTS_EIGHT << 16)        /**< Shifted mode EIGHT for LDMA_CH_CFG          */
#define LDMA_CH_CFG_SRCINCSIGN                  (0x1UL << 20)                              /**< Source Address Increment Sign               */
#define _LDMA_CH_CFG_SRCINCSIGN_SHIFT           20                                         /**< Shift value for LDMA_SRCINCSIGN             */
#define _LDMA_CH_CFG_SRCINCSIGN_MASK            0x100000UL                                 /**< Bit mask for LDMA_SRCINCSIGN                */
#define _LDMA_CH_CFG_SRCINCSIGN_DEFAULT         0x00000000UL                               /**< Mode DEFAULT for LDMA_CH_CFG                */
#define _LDMA_CH_CFG_SRCINCSIGN_POSITIVE        0x00000000UL                               /**< Mode POSITIVE for LDMA_CH_CFG               */
#define _LDMA_CH_CFG_SRCINCSIGN_NEGATIVE        0x00000001UL                               /**< Mode NEGATIVE for LDMA_CH_CFG               */
#define LDMA_CH_CFG_SRCINCSIGN_DEFAULT          (_LDMA_CH_CFG_SRCINCSIGN_DEFAULT << 20)    /**< Shifted mode DEFAULT for LDMA_CH_CFG        */
#define LDMA_CH_CFG_SRCINCSIGN_POSITIVE         (_LDMA_CH_CFG_SRCINCSIGN_POSITIVE << 20)   /**< Shifted mode POSITIVE for LDMA_CH_CFG       */
#define LDMA_CH_CFG_SRCINCSIGN_NEGATIVE         (_LDMA_CH_CFG_SRCINCSIGN_NEGATIVE << 20)   /**< Shifted mode NEGATIVE for LDMA_CH_CFG       */
#define LDMA_CH_CFG_DSTINCSIGN                  (0x1UL << 21)                              /**< Destination Address Increment Sign          */
#define _LDMA_CH_CFG_DSTINCSIGN_SHIFT           21                                         /**< Shift value for LDMA_DSTINCSIGN             */
#define _LDMA_CH_CFG_DSTINCSIGN_MASK            0x200000UL                                 /**< Bit mask for LDMA_DSTINCSIGN                */
#define _LDMA_CH_CFG_DSTINCSIGN_DEFAULT         0x00000000UL                               /**< Mode DEFAULT for LDMA_CH_CFG                */
#define _LDMA_CH_CFG_DSTINCSIGN_POSITIVE        0x00000000UL                               /**< Mode POSITIVE for LDMA_CH_CFG               */
#define _LDMA_CH_CFG_DSTINCSIGN_NEGATIVE        0x00000001UL                               /**< Mode NEGATIVE for LDMA_CH_CFG               */
#define LDMA_CH_CFG_DSTINCSIGN_DEFAULT          (_LDMA_CH_CFG_DSTINCSIGN_DEFAULT << 21)    /**< Shifted mode DEFAULT for LDMA_CH_CFG        */
#define LDMA_CH_CFG_DSTINCSIGN_POSITIVE         (_LDMA_CH_CFG_DSTINCSIGN_POSITIVE << 21)   /**< Shifted mode POSITIVE for LDMA_CH_CFG       */
#define LDMA_CH_CFG_DSTINCSIGN_NEGATIVE         (_LDMA_CH_CFG_DSTINCSIGN_NEGATIVE << 21)   /**< Shifted mode NEGATIVE for LDMA_CH_CFG       */
#define LDMA_CH_CFG_STRUCTBUSPORT               (0x1UL << 22)                              /**< Structure Fetch Bus Port                    */
#define _LDMA_CH_CFG_STRUCTBUSPORT_SHIFT        22                                         /**< Shift value for LDMA_STRUCTBUSPORT          */
#define _LDMA_CH_CFG_STRUCTBUSPORT_MASK         0x400000UL                                 /**< Bit mask for LDMA_STRUCTBUSPORT             */
#define _LDMA_CH_CFG_STRUCTBUSPORT_DEFAULT      0x00000000UL                               /**< Mode DEFAULT for LDMA_CH_CFG                */
#define _LDMA_CH_CFG_STRUCTBUSPORT_AHBM0        0x00000000UL                               /**< Mode AHBM0 for LDMA_CH_CFG                  */
#define _LDMA_CH_CFG_STRUCTBUSPORT_AHBM1        0x00000001UL                               /**< Mode AHBM1 for LDMA_CH_CFG                  */
#define LDMA_CH_CFG_STRUCTBUSPORT_DEFAULT       (_LDMA_CH_CFG_STRUCTBUSPORT_DEFAULT << 22) /**< Shifted mode DEFAULT for LDMA_CH_CFG        */
#define LDMA_CH_CFG_STRUCTBUSPORT_AHBM0         (_LDMA_CH_CFG_STRUCTBUSPORT_AHBM0 << 22)   /**< Shifted mode AHBM0 for LDMA_CH_CFG          */
#define LDMA_CH_CFG_STRUCTBUSPORT_AHBM1         (_LDMA_CH_CFG_STRUCTBUSPORT_AHBM1 << 22)   /**< Shifted mode AHBM1 for LDMA_CH_CFG          */
#define LDMA_CH_CFG_SRCBUSPORT                  (0x1UL << 23)                              /**< Source Bus Port                             */
#define _LDMA_CH_CFG_SRCBUSPORT_SHIFT           23                                         /**< Shift value for LDMA_SRCBUSPORT             */
#define _LDMA_CH_CFG_SRCBUSPORT_MASK            0x800000UL                                 /**< Bit mask for LDMA_SRCBUSPORT                */
#define _LDMA_CH_CFG_SRCBUSPORT_DEFAULT         0x00000000UL                               /**< Mode DEFAULT for LDMA_CH_CFG                */
#define _LDMA_CH_CFG_SRCBUSPORT_AHBM0           0x00000000UL                               /**< Mode AHBM0 for LDMA_CH_CFG                  */
#define _LDMA_CH_CFG_SRCBUSPORT_AHBM1           0x00000001UL                               /**< Mode AHBM1 for LDMA_CH_CFG                  */
#define LDMA_CH_CFG_SRCBUSPORT_DEFAULT          (_LDMA_CH_CFG_SRCBUSPORT_DEFAULT << 23)    /**< Shifted mode DEFAULT for LDMA_CH_CFG        */
#define LDMA_CH_CFG_SRCBUSPORT_AHBM0            (_LDMA_CH_CFG_SRCBUSPORT_AHBM0 << 23)      /**< Shifted mode AHBM0 for LDMA_CH_CFG          */
#define LDMA_CH_CFG_SRCBUSPORT_AHBM1            (_LDMA_CH_CFG_SRCBUSPORT_AHBM1 << 23)      /**< Shifted mode AHBM1 for LDMA_CH_CFG          */
#define LDMA_CH_CFG_DSTBUSPORT                  (0x1UL << 24)                              /**< Destination Bus Port                        */
#define _LDMA_CH_CFG_DSTBUSPORT_SHIFT           24                                         /**< Shift value for LDMA_DSTBUSPORT             */
#define _LDMA_CH_CFG_DSTBUSPORT_MASK            0x1000000UL                                /**< Bit mask for LDMA_DSTBUSPORT                */
#define _LDMA_CH_CFG_DSTBUSPORT_DEFAULT         0x00000000UL                               /**< Mode DEFAULT for LDMA_CH_CFG                */
#define _LDMA_CH_CFG_DSTBUSPORT_AHBM0           0x00000000UL                               /**< Mode AHBM0 for LDMA_CH_CFG                  */
#define _LDMA_CH_CFG_DSTBUSPORT_AHBM1           0x00000001UL                               /**< Mode AHBM1 for LDMA_CH_CFG                  */
#define LDMA_CH_CFG_DSTBUSPORT_DEFAULT          (_LDMA_CH_CFG_DSTBUSPORT_DEFAULT << 24)    /**< Shifted mode DEFAULT for LDMA_CH_CFG        */
#define LDMA_CH_CFG_DSTBUSPORT_AHBM0            (_LDMA_CH_CFG_DSTBUSPORT_AHBM0 << 24)      /**< Shifted mode AHBM0 for LDMA_CH_CFG          */
#define LDMA_CH_CFG_DSTBUSPORT_AHBM1            (_LDMA_CH_CFG_DSTBUSPORT_AHBM1 << 24)      /**< Shifted mode AHBM1 for LDMA_CH_CFG          */

/* Bit fields for LDMA CH_LOOP */
#define _LDMA_CH_LOOP_RESETVALUE                0x00000000UL                            /**< Default value for LDMA_CH_LOOP              */
#define _LDMA_CH_LOOP_MASK                      0x000000FFUL                            /**< Mask for LDMA_CH_LOOP                       */
#define _LDMA_CH_LOOP_LOOPCNT_SHIFT             0                                       /**< Shift value for LDMA_LOOPCNT                */
#define _LDMA_CH_LOOP_LOOPCNT_MASK              0xFFUL                                  /**< Bit mask for LDMA_LOOPCNT                   */
#define _LDMA_CH_LOOP_LOOPCNT_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for LDMA_CH_LOOP               */
#define LDMA_CH_LOOP_LOOPCNT_DEFAULT            (_LDMA_CH_LOOP_LOOPCNT_DEFAULT << 0)    /**< Shifted mode DEFAULT for LDMA_CH_LOOP       */

