espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_ldma.h
/* Bit fields for LDMA CH_DST */
#define _LDMA_CH_DST_RESETVALUE                 0x00000000UL                            /**< Default value for LDMA_CH_DST               */
#define _LDMA_CH_DST_MASK                       0xFFFFFFFFUL                            /**< Mask for LDMA_CH_DST                        */
#define _LDMA_CH_DST_ADDR_SHIFT                 0                                       /**< Shift value for LDMA_ADDR                   */
#define _LDMA_CH_DST_ADDR_MASK                  0xFFFFFFFFUL                            /**< Bit mask for LDMA_ADDR                      */
#define _LDMA_CH_DST_ADDR_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for LDMA_CH_DST                */
#define LDMA_CH_DST_ADDR_DEFAULT                (_LDMA_CH_DST_ADDR_DEFAULT << 0)        /**< Shifted mode DEFAULT for LDMA_CH_DST        */

/* Bit fields for LDMA CH_LINK */
#define _LDMA_CH_LINK_RESETVALUE                0x00000000UL                            /**< Default value for LDMA_CH_LINK              */
#define _LDMA_CH_LINK_MASK                      0xFFFFFFFFUL                            /**< Mask for LDMA_CH_LINK                       */
#define LDMA_CH_LINK_LINKMODE                   (0x1UL << 0)                            /**< Link Structure Addressing Mode              */
#define _LDMA_CH_LINK_LINKMODE_SHIFT            0                                       /**< Shift value for LDMA_LINKMODE               */
#define _LDMA_CH_LINK_LINKMODE_MASK             0x1UL                                   /**< Bit mask for LDMA_LINKMODE                  */
#define _LDMA_CH_LINK_LINKMODE_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for LDMA_CH_LINK               */
#define _LDMA_CH_LINK_LINKMODE_ABSOLUTE         0x00000000UL                            /**< Mode ABSOLUTE for LDMA_CH_LINK              */
#define _LDMA_CH_LINK_LINKMODE_RELATIVE         0x00000001UL                            /**< Mode RELATIVE for LDMA_CH_LINK              */
#define LDMA_CH_LINK_LINKMODE_DEFAULT           (_LDMA_CH_LINK_LINKMODE_DEFAULT << 0)   /**< Shifted mode DEFAULT for LDMA_CH_LINK       */
#define LDMA_CH_LINK_LINKMODE_ABSOLUTE          (_LDMA_CH_LINK_LINKMODE_ABSOLUTE << 0)  /**< Shifted mode ABSOLUTE for LDMA_CH_LINK      */
#define LDMA_CH_LINK_LINKMODE_RELATIVE          (_LDMA_CH_LINK_LINKMODE_RELATIVE << 0)  /**< Shifted mode RELATIVE for LDMA_CH_LINK      */
#define LDMA_CH_LINK_LINK                       (0x1UL << 1)                            /**< Link Next Structure                         */
#define _LDMA_CH_LINK_LINK_SHIFT                1                                       /**< Shift value for LDMA_LINK                   */
#define _LDMA_CH_LINK_LINK_MASK                 0x2UL                                   /**< Bit mask for LDMA_LINK                      */
#define _LDMA_CH_LINK_LINK_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for LDMA_CH_LINK               */
#define LDMA_CH_LINK_LINK_DEFAULT               (_LDMA_CH_LINK_LINK_DEFAULT << 1)       /**< Shifted mode DEFAULT for LDMA_CH_LINK       */
#define _LDMA_CH_LINK_LINKADDR_SHIFT            2                                       /**< Shift value for LDMA_LINKADDR               */
#define _LDMA_CH_LINK_LINKADDR_MASK             0xFFFFFFFCUL                            /**< Bit mask for LDMA_LINKADDR                  */
#define _LDMA_CH_LINK_LINKADDR_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for LDMA_CH_LINK               */
#define LDMA_CH_LINK_LINKADDR_DEFAULT           (_LDMA_CH_LINK_LINKADDR_DEFAULT << 2)   /**< Shifted mode DEFAULT for LDMA_CH_LINK       */

/* Bit fields for LDMA CH_XCTRL */
#define _LDMA_CH_XCTRL_RESETVALUE               0x00000000UL                             /**< Default value for LDMA_CH_XCTRL             */
#define _LDMA_CH_XCTRL_MASK                     0x000000F0UL                             /**< Mask for LDMA_CH_XCTRL                      */
#define LDMA_CH_XCTRL_DSTILEN                   (0x1UL << 4)                             /**< Destination Interleave                      */
#define _LDMA_CH_XCTRL_DSTILEN_SHIFT            4                                        /**< Shift value for LDMA_DSTILEN                */
#define _LDMA_CH_XCTRL_DSTILEN_MASK             0x10UL                                   /**< Bit mask for LDMA_DSTILEN                   */
#define _LDMA_CH_XCTRL_DSTILEN_DEFAULT          0x00000000UL                             /**< Mode DEFAULT for LDMA_CH_XCTRL              */
#define LDMA_CH_XCTRL_DSTILEN_DEFAULT           (_LDMA_CH_XCTRL_DSTILEN_DEFAULT << 4)    /**< Shifted mode DEFAULT for LDMA_CH_XCTRL      */
#define _LDMA_CH_XCTRL_ILMODE_SHIFT             5                                        /**< Shift value for LDMA_ILMODE                 */
#define _LDMA_CH_XCTRL_ILMODE_MASK              0x60UL                                   /**< Bit mask for LDMA_ILMODE                    */
#define _LDMA_CH_XCTRL_ILMODE_DEFAULT           0x00000000UL                             /**< Mode DEFAULT for LDMA_CH_XCTRL              */
#define _LDMA_CH_XCTRL_ILMODE_ABSOLUTE          0x00000000UL                             /**< Mode ABSOLUTE for LDMA_CH_XCTRL             */
#define _LDMA_CH_XCTRL_ILMODE_RELATIVE16        0x00000001UL                             /**< Mode RELATIVE16 for LDMA_CH_XCTRL           */
#define _LDMA_CH_XCTRL_ILMODE_RELATIVE8         0x00000002UL                             /**< Mode RELATIVE8 for LDMA_CH_XCTRL            */
#define LDMA_CH_XCTRL_ILMODE_DEFAULT            (_LDMA_CH_XCTRL_ILMODE_DEFAULT << 5)     /**< Shifted mode DEFAULT for LDMA_CH_XCTRL      */
#define LDMA_CH_XCTRL_ILMODE_ABSOLUTE           (_LDMA_CH_XCTRL_ILMODE_ABSOLUTE << 5)    /**< Shifted mode ABSOLUTE for LDMA_CH_XCTRL     */
#define LDMA_CH_XCTRL_ILMODE_RELATIVE16         (_LDMA_CH_XCTRL_ILMODE_RELATIVE16 << 5)  /**< Shifted mode RELATIVE16 for LDMA_CH_XCTRL   */
#define LDMA_CH_XCTRL_ILMODE_RELATIVE8          (_LDMA_CH_XCTRL_ILMODE_RELATIVE8 << 5)   /**< Shifted mode RELATIVE8 for LDMA_CH_XCTRL    */
#define LDMA_CH_XCTRL_BUFFERABLE                (0x1UL << 7)                             /**< Allow AHB buffering                         */
#define _LDMA_CH_XCTRL_BUFFERABLE_SHIFT         7                                        /**< Shift value for LDMA_BUFFERABLE             */
#define _LDMA_CH_XCTRL_BUFFERABLE_MASK          0x80UL                                   /**< Bit mask for LDMA_BUFFERABLE                */
#define _LDMA_CH_XCTRL_BUFFERABLE_DEFAULT       0x00000000UL                             /**< Mode DEFAULT for LDMA_CH_XCTRL              */
#define LDMA_CH_XCTRL_BUFFERABLE_DEFAULT        (_LDMA_CH_XCTRL_BUFFERABLE_DEFAULT << 7) /**< Shifted mode DEFAULT for LDMA_CH_XCTRL      */

/* Bit fields for LDMA CH_ILSRC */
#define _LDMA_CH_ILSRC_RESETVALUE               0x00000000UL                            /**< Default value for LDMA_CH_ILSRC             */
#define _LDMA_CH_ILSRC_MASK                     0xFFFFFFFFUL                            /**< Mask for LDMA_CH_ILSRC                      */
#define _LDMA_CH_ILSRC_ADDR_SHIFT               0                                       /**< Shift value for LDMA_ADDR                   */
#define _LDMA_CH_ILSRC_ADDR_MASK                0xFFFFFFFFUL                            /**< Bit mask for LDMA_ADDR                      */
#define _LDMA_CH_ILSRC_ADDR_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for LDMA_CH_ILSRC              */
#define LDMA_CH_ILSRC_ADDR_DEFAULT              (_LDMA_CH_ILSRC_ADDR_DEFAULT << 0)      /**< Shifted mode DEFAULT for LDMA_CH_ILSRC      */

/** @} End of group EFR32FG25_LDMA_BitFields */
/** @} End of group EFR32FG25_LDMA */
/** @} End of group Parts */

#endif /* EFR32FG25_LDMA_H */
